# GetUnlockedMullionIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurtainGrid..::..GetUnlockedMullionIds Method
CurtainGrid Class See Also
---
Gets all ElementIds of the unlocked mullions of the curtain grid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ICollection<ElementId> GetUnlockedMullionIds()
```

Visual Basic
---
```text
Public Function GetUnlockedMullionIds As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetUnlockedMullionIds()
```

# ### Return Value
The unlocked mullion ElementIds
# Remarks
ElementIds are of Mullion Elements.
# See Also
CurtainGrid Class
Autodesk.Revit.DB Namespace